{
    "top_name": "Hancheng Zuo",
    "top_info": "Software Systems Engineering Graduate Student, University College London",
    "summary": "SUMMARY",
    "summary_info": "A current Software Engineering postgraduate student at UCL and a graduate of Aberystwyth University with a first-class degree in Computer Science and Artificial Intelligence. I was awarded the Best Group Award in Software Engineering module and have experience as a teaching assistant, as well as in algorithm and computer vision research. I have published papers in the field of computer vision. My skills include a strong understanding of C/C++, Java, Python programming, and Machine Learning, developed through both academic training and professional experience. Additionally, I have experience in application development using GPT API.",
    "skills": "SKILLS",
    "skills_bottom": "Skills:",
    "experience": "EXPERIENCE",
    "exp_web_title": "Web and AI Development Intern",
    "exp_web_duration": "Jun 2023 - Sep 2023",
    "exp_web_location": "Edinburgh, UK",
    "exp_web_info_1_title": "AI Website Development:",
    "exp_web_info_1_description": " Developed a GPT-driven AI website using the Python Flask framework and Gunicorn server to extract customized summaries from scientific papers for bioprocessing researchers.",
    "exp_web_info_2_title": "Server-side Deployment:",
    "exp_web_info_2_description": " Managed the deployment of the Flask application on Gunicorn server, ensuring smooth operation and accessibility.",
    "exp_web_info_3_title": "API Integration:",
    "exp_web_info_3_description": " Integrated essential functionalities like email forwarding APIs to enhance the application's capabilities.",
    "exp_web_info_4_title": "Regular Updates and Meetings:",
    "exp_web_info_4_description": " Participated in weekly meetings to discuss project progress, provide updates, and address any challenges encountered. Utilized project management tools such as Asana to track tasks and milestones.",
    "exp_web_info_5_title": "Feedback and Improvement:",
    "exp_web_info_5_description": " Actively sought feedback on the AI tool and made necessary improvements to optimize its performance and usability.",
    "exp_web_info_6_description": "This role enhanced my skills in AI and web development, server-side deployment, and API integration, contributing to a tool that greatly benefits researchers in the bioprocessing field.",

    "exp_dem_title": "Demonstrator",
    "exp_dem_duration": "Sep 2022 - Dec 2022",
    "exp_dem_location": "Wales, UK",
    "exp_dem_info_1_description": "Acting as a seminar demonstrator for five courses (CS12020: Introduction to Programming, CS21120: Algorithm Design and Data Structures, CS23820: C and C++, CS01010: Spreadsheets for University Students, CS27020: Modelling Persistent Data).",
    "exp_dem_info_2_description": "Preparing course materials for the practical sessions.",
    "exp_dem_info_3_description": "Supervising practical sessions and answer any questions from students.",
    "exp_dem_info_4_description": "Assisting Lecturers in the evaluation of students’ work.",

    "exp_ear_title": "Evolutionary Algorithms Researcher",
    "exp_ear_duration": "Jun 2022 - Sep 2022",
    "exp_ear_position": "Wales, UK",
    "exp_ear_info_1_description": "Employed by the Aberystwyth University as a research assistant.",
    "exp_ear_info_2_description": "Conducting evolutionary algorithm research in C and C++.",
    "exp_ear_info_3_description": "Simulating the evolutionary superiority and inferiority of organisms as well as genetic crossover and variation.",
    "exp_ear_info_4_description": "Finding the most adapted individuals through iteration.",
    "exp_ear_info_5_description": "Continuously experimenting with different genetic operators (three basic genetic operators: selection; crossover; mutation).",

    "exp_dai_title": "Data Annotation Intern",
    "exp_dai_duration": "Jul 2019 - Sep 2019",
    "exp_dai_location": "Beijing, China",
    "exp_dai_info_1_description": "Collected both qualitative and quantitative data from local administrative platforms and social media channels.",
    "exp_dai_info_2_description": "Cleaned and analysed the data collected to support the marketing team.",
    
    "education_title": "EDUCATION",
    "msc_title": "MSc Software Systems Engineering",
    "msc_duration": "Sep 2023 - Dec 2024",
    "msc_uni": "University College London",

    "bsc_title": "BSc Computer Science and Artificial Intelligence",
    "bsc_duration": "Sep 2020 - Jun 2023",
    "bsc_uni": "Aberystwyth University",
    "exp_bsc_info_1_title": "Grade: ",
    "exp_bsc_info_1_description": "First-Class Honours",
    "exp_bsc_info_2_title": "Awards: ",
    "exp_bsc_info_2_description": "Best Second Year Group Project 2022",
    "exp_bsc_info_3_title": "Core Coursework: ",
    "exp_bsc_info_3_description": "Algorithm Design and Data Structures, Artificial Intelligence, Machine Learning, Modelling Persistent Data, System and Network Services Administration, Software Engineering, Robotics and Embedded Systems, Computer Graphics and Games.",

    "edu_last_title": "Critical Thinking and Communication Skills",
    "edu_last_duration": "Jan 2019 - Feb 2019",
    "edu_last_uni": "The University of Western Australia",

    "publication": "PUBLICATIONS",
    "publication_title_1": "Inpainting Normal Maps for Lightstage data",
    "publication_title_2": "A U-Net Architecture for Inpainting Lightstage Normal Maps",
    "publication_author_1": "Hancheng Zuo"
    
}